


var hotquery = {
	word:["爱美","牛栏山","奶粉","纸尿裤","韩国","德国","食品","化妆品"]
}

var htmlStr1 = template("hotQuery",hotquery);
var hq = document.getElementById("hot-query")
	hq.innerHTML = htmlStr1;
//--------------------------------------------------------------------------

var headerRightImg = {
	imgsrc:["img/7day.jpg","img/guarantee.jpg","img/delivery.jpg"]
}
var htmlStr4 = template("headerRight",headerRightImg);
var s = document.getElementById("header-right")
	s.innerHTML = htmlStr4;
//--------------------------------------------------------------------------
var allCate = {
	li:[
		{
			title:"食品/酒水/生鲜",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["休闲零食","坚果炒货","肉干肉脯","蜜饯果干","糖果/巧克力","饼干蛋糕"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]			
			},
		{
			title:"母婴/玩具乐器",
			h4:["奶粉","营养辅食","玩具乐器"],
			dl:[
				{
					dt:"奶粉",
					dd:["婴幼奶粉","成人奶粉"]
				},
				{
					dt:"尿裤湿巾",
					dd:["尿裤/拉拉裤","湿巾"]
				},
				{
					dt:"营养辅食",
					dd:["益生菌/初乳","米粉/菜粉/面条/粥","果泥/果汁","DHA/钙铁锌/维生素","宝宝零食"]
				},
				{
					dt:"营养辅食",
					dd:["益生菌/初乳","米粉/菜粉/面条/粥","果泥/果汁","DHA/钙铁锌/维生素","宝宝零食"]
				},
				{
					dt:"营养辅食",
					dd:["益生菌/初乳","米粉/菜粉/面条/粥","果泥/果汁","DHA/钙铁锌/维生素","宝宝零食"]
				},
				{
					dt:"营养辅食",
					dd:["益生菌/初乳","米粉/菜粉/面条/粥","果泥/果汁","DHA/钙铁锌/维生素","宝宝零食"]
				}
			]
			},
		{
			title:"化妆个护",
			h4:["面部护肤","身体护理","洗发护发"],
			dl:[
				{
					dt:"面部护肤",
					dd:["清洁","护肤","面膜","套装"]
				},
				{
					dt:"身体护理",
					dd:["沐浴","润肤","手足","纤体塑性","美胸"]
				},
				{
					dt:"营养辅食",
					dd:["益生菌/初乳","米粉/菜粉/面条/粥","果泥/果汁","宝宝零食"]
				}
			]
		},
		{
			title:"家居/家具/家装/厨具/家纺",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"手机/数码",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"鞋靴/箱包/钟表/礼品",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"男装/女装/内衣/装饰",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"家用电器",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"营养保健",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"电脑办公",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"汽车及配件装饰",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"户外运动",
			h4:["休闲食品","休闲食品","休闲食品"],
			dl:[
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"休闲食品",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				},
				{
					dt:"生鲜",
					dd:["水果/果蔬","海鲜水产","肉禽蛋奶","熟食腊味"]
				}
			]
		},
		{
			title:"旅行/婚庆/线下服务"
		}
	]
};

var htmlStr3 = template("allCate",allCate);
var ac = document.getElementById("all-cate")
	ac.innerHTML = htmlStr3;		
//---------------------------------------------------------------------------
var trigeminyImg = {
	imgsrc:["img/trigeminy/1476156826339504997.jpg","img/trigeminy/1463367128215980339.jpg","img/trigeminy/1476156861353077338.jpg"]
}
var htmlStr5 = template("tri",trigeminyImg);
var tr = document.getElementById("trigeminy")
	tr.innerHTML = htmlStr5;
//---------------------------------------------------------------------------
var news = {
	newstitle:["西汉张骞拼命换来的宝贝就在荥阳！！","今年月饼节只需19.8元！ ","巨型一号保你和奥运美眉一样水嫩！","奥运会开幕这件事比拿金牌更重要！","￥29.00包邮韩国自然乐园芦荟胶"],
	src:[]
}
var htmlStr6 = template("mn",news);
var ns = document.getElementById("mall-news")
	ns.innerHTML = htmlStr6;
//---------------------------------------------------------------------------
var adImg = {
	imgsrc:["img/ad-groups/1473470102416850267.jpg","img/ad-groups/1477119642996745749.jpg","img/ad-groups/1478162529091774460.jpg","img/ad-groups/1476944435185611076.jpg","img/ad-groups/1477984762548458427.jpg"]
}
var htmlStr7 = template("ad",adImg);
var adbox = document.getElementById("ad-groups")
	adbox.innerHTML = htmlStr7;

//---------------------------------------------------------------------------
$.post("/goods-data",function(resData){
	//console.dir(resData.data)

		if(resData.err == 0){
			var data = resData.data;
			var dd = {
				title:["疯狂抢购","热销排行","商城热卖","商城推荐","新品上市"],
				street:[],
				goods:[ [],[],[],[],[] ]
			}
			
			for(var j=0;j<5;j++){
				for(var i = 0;i<5;i++){
					var o1 = data.find(function(obj){
						return obj.identifier == dd.title[i]+(j+1);
					})
					if(o1){
						dd.goods[i].push(o1)
					}
					
				}
			}
				
			var street = [];
			data.map(function(obj,index){
				if(!isNaN(obj.identifier*1)){
					street.push(obj)
				}
				
			})
			
			for(var i=0;i<street.length;i++){
				var o2 = street.find(function(obj){
					return obj.identifier == (i+1)+"";
				})
				dd.street.push(o2)
			}
		
			var htmlStr = template("tt",dd);
			var indexSale = document.getElementById("index-sale")
			indexSale.innerHTML = htmlStr;
			
			var htmlStr2 = template("tab",dd);
			var storeCon = document.getElementById("store-wall-content")
			storeCon.innerHTML = htmlStr2;
			
		}
	});


